[
	{
		"id": "project-1",
		"imagePath": "projects/ekans-cover.jpg",
		"title": "ekanS",
		"category": ["video game"],
		"techStack": ["Godot", "Firebase Authentication", "Cloud Firestore"],
		"status": "Try Demo",
		"link": "",
		"repo": "https://github.com/house-of-the-badger/ekansREBORN",
		"description": "Classic Snake game... in reverse!",
		"presentation": "ekanS is a fresh twist on the classic Snake game... played in reverse! Developed as part of a bootcamp project, it allowed our team to dive into Object Oriented Programming and explore game development with the GoDot engine. Players can log in, choose an avatar, and navigate through six challenging levels using swipe gestures. We’ve implemented Firebase for user authentication and data storage, ensuring a smooth and secure experience. Future updates will include additional levels, a leaderboard, and more game modes. The project emphasized team collaboration and version control through GitHub, with Trello and Figma guiding our planning and design."
	},
	{
		"id": "project-2",
		"imagePath": "projects/project.png",
		"title": "XQ News",
		"category": ["web"],
		"techStack": [
			"PostgreSQL",
			"JavaScript",
			"Express.JS",
			"Axios",
			"Supabase",
			"Render",
			"React.JS",
			"Vite",
			"Netlify"
		],
		"status": "Live Demo",
		"link": "",
		"repo": "https://github.com/XiaoQuark/nc-news-frontend",
		"description": "A social media inspired by Reddit",
		"presentation": "XQ News is a Reddit-inspired social media platform, developed to showcase full-stack capabilities. Built with React.js and Express.js, it features efficient data management and real-time user interactions through a custom API. The application handles complex data queries, providing a dynamic and responsive user experience across devices. Designed with a mobile-first approach, XQ News ensures seamless navigation and usability, making it a robust example of modern web development."
	},
	{
		"id": "project-3",
		"imagePath": "projects/artilab-cover.png",
		"title": "Artilab Gallery",
		"category": ["web"],
		"techStack": [
			"WordPress",
			"HTML",
			"CSS",
			"MySQL",
			"MailerLite",
			"SEO",
			"Figma"
		],
		"status": "Visit Website",
		"link": "https://www.artilab.gallery/",
		"description": "Website for an art gallery in Milan",
		"presentation": "I revitalized Artilab Gallery's online presence with a modern, responsive website that reflects the sophistication of Milan's contemporary art scene. The redesign aligns with the gallery's new branding, emphasizing user-centric design and current web trends. Inspired by their new minimalistic logo, I crafted a website that showcases exhibitions, artist profiles, and events, with plans to integrate an e-commerce section for online sales."
	},
	{
		"id": "project-4",
		"imagePath": "projects/project.png",
		"title": "Hilary King",
		"category": ["web", "video game"],
		"techStack": ["Webflow", "HTML", "CSS", "MySQL", "Figma"],
		"status": "Live Demo",
		"link": "https://hilary-king.webflow.io/",
		"description": "Mid Century Murders: Web project for a game that will one day exist",
		"presentation": "Hilary King Mysteries is a passion project born from my love for adventure games and mid-century aesthetics. Originally conceived as a comic, I developed a website during my Digital Media studies to bring the character and her world to life. The design draws inspiration from 1950s comic strips, featuring a unique horizontal scrolling layout that reflects my personal style. While the current design captures the era’s charm, I am working on a responsive redesign to enhance accessibility and usability."
	},
	{
		"id": "project-5",
		"imagePath": "projects/project.png",
		"title": "Glauco Baruzzi",
		"category": ["web"],
		"techStack": ["WordPress", "HTML", "CSS", "MySQL", "Figma"],
		"status": "Prototype",
		"link": "https://www.figma.com/proto/DgxCWlcKglKD6C2t5ZjMfe/glauco_baruzzi?page-id=0%3A1&node-id=16-25&viewport=307%2C204%2C0.03&t=WTIlt3tfbMGIn4XV-1&scaling=scale-down&content-scaling=fixed&starting-point-node-id=16%3A3",
		"description": "Artist's portfolio project",
		"presentation": "Coming Soon"
	}
]
